In [45]:
!pip install scikit-learn numpy

Requirement already satisfied: scikit-learn in /Library/Frameworks/Python.framework/Versions/3.11/lib/python3.11/site-packages (1.4.1.post1)
Requirement already satisfied: numpy in /Library/Frameworks/Python.framework/Versions/3.11/lib/python3.11/site-packages (1.26.4)
Requirement already satisfied: scipy>=1.6.0 in /Library/Frameworks/Python.framework/Versions/3.11/lib/python3.11/site-packages (from scikit-learn) (1.12.0)
Requirement already satisfied: joblib>=1.2.0 in /Library/Frameworks/Python.framework/Versions/3.11/lib/python3.11/site-packages (from scikit-learn) (1.3.2)
Requirement already satisfied: threadpoolctl>=2.0.0 in /Library/Frameworks/Python.framework/Versions/3.11/lib/python3.11/site-packages (from scikit-learn) (3.2.0)

In [46]:
import numpy as np
import pandas as pd
from sklearn.datasets import load_iris

In [47]:
iris = load_iris()
df = pd.DataFrame(iris.data, columns=iris.feature_names)

In [48]:
df.head()

   sepal length (cm)  sepal width (cm)  petal length (cm)  petal width (cm)
0                5.1               3.5                1.4               0.2
1                4.9               3.0                1.4               0.2
2                4.7               3.2                1.3               0.2
3                4.6               3.1                1.5               0.2
4                5.0               3.6                1.4               0.2

In [43]:
df['species'] = iris.target

In [44]:
df.head()

,sepal length (cm),sepal width (cm),petal length (cm),petal width (cm),species
0,5.1,3.5,1.4,0.2,0
1,4.9,3.0,1.4,0.2,0
2,4.7,3.2,1.3,0.2,0
3,4.6,3.1,1.5,0.2,0
4,5.0,3.6,1.4,0.2,0

In [49]:
df.columns

Index(['sepal length (cm)', 'sepal width (cm)', 'petal length (cm)',
       'petal width (cm)'],
      dtype='object')

In [52]:
# df_selected = df['petal width (cm)']
df_selected = df[['petal width (cm)', 'petal length (cm)']]
df_selected.head()

   petal width (cm)  petal length (cm)
0               0.2                1.4
1               0.2                1.4
2               0.2                1.3
3               0.2                1.5
4               0.2                1.4

In [5]:
# Creating a DataFrame
data = {
    'name': ['Alice', 'Bob', 'Charlie', 'David', 'Emily'],
    'age': [25, 32, 18, 47, 29],
    'city': ['New York', 'Paris', 'London', 'Berlin', 'New York']
}
df = pd.DataFrame(data)

In [6]:
df.head()

      name  age      city
0    Alice   25  New York
1      Bob   32     Paris
2  Charlie   18    London
3    David   47    Berlin
4    Emily   29  New York

In [7]:
df.tail()

      name  age      city
0    Alice   25  New York
1      Bob   32     Paris
2  Charlie   18    London
3    David   47    Berlin
4    Emily   29  New York

In [8]:
df.shape

(5, 3)

In [9]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    5 non-null      object
 1   age     5 non-null      int64
 2   city    5 non-null      object
dtypes: int64(1), object(2)
memory usage: 252.0+ bytes

In [10]:
df.describe()

             age
count   5.000000
mean   30.200000
std    10.756393
min    18.000000
25%    25.000000
50%    29.000000
75%    32.000000
max    47.000000

In [11]:
# Selecting columns
df[['name', 'age']].head()

      name  age
0    Alice   25
1      Bob   32
2  Charlie   18
3    David   47
4    Emily   29

In [12]:
# Filtering rows
df[df['age'] > 30]

    name  age    city
1    Bob   32   Paris
3  David   47  Berlin

In [13]:
df[df['city'] == 'New York']

    name  age      city
0  Alice   25  New York
4  Emily   29  New York

In [14]:
# Creating a new column
df['age_in_5_years'] = df['age'] + 5
df.head()

      name  age      city  age_in_5_years
0    Alice   25  New York              30
1      Bob   32     Paris              37
2  Charlie   18    London              23
3    David   47    Berlin              52
4    Emily   29  New York              34

In [15]:
# Renaming and dropping columns
df.rename(columns={'age_in_5_years': 'age_future'}, inplace=True)
df.drop(columns=['age'], inplace=True)
df.head()

      name      city  age_future
0    Alice  New York          30
1      Bob     Paris          37
2  Charlie    London          23
3    David    Berlin          52
4    Emily  New York          34

In [16]:
# Applying built-in methods
df['age_future'].mean()

35.2

In [17]:
df['age_future'].std()

10.756393447619885

In [18]:
df['age_future'].min()

23

In [19]:
df['age_future'].max()

52

In [20]:
df['age_future'].var()

115.7

In [21]:
df['age_future'].unique()

array([30, 37, 23, 52, 34])

In [22]:
# Grouping and aggregating
grouped = df.groupby('city')

In [23]:
grouped.agg({'age_future': ['mean', 'min', 'max']})

         age_future
               mean min max
city
Berlin         52.0  52  52
London         23.0  23  23
New York       32.0  30  34
Paris          37.0  37  37

In [24]:
df = pd.read_csv('iris.csv')

In [25]:
df.head(10)

   sepal_length  sepal_width  petal_length  petal_width species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa
5           5.4          3.9           1.7          0.4  setosa
6           4.6          3.4           1.4          0.3  setosa
7           5.0          3.4           1.5          0.2  setosa
8           4.4          2.9           1.4          0.2  setosa
9           4.9          3.1           1.5          0.1  setosa

In [26]:
df.tail()

     sepal_length  sepal_width  petal_length  petal_width    species
145           6.7          3.0           5.2          2.3  virginica
146           6.3          2.5           5.0          1.9  virginica
147           6.5          3.0           5.2          2.0  virginica
148           6.2          3.4           5.4          2.3  virginica
149           5.9          3.0           5.1          1.8  virginica

In [27]:
df.shape

(150, 5)

In [28]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 150 entries, 0 to 149
Data columns (total 5 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   sepal_length  150 non-null    float64
 1   sepal_width   150 non-null    float64
 2   petal_length  150 non-null    float64
 3   petal_width   150 non-null    float64
 4   species       150 non-null    object
dtypes: float64(4), object(1)
memory usage: 6.0+ KB

In [29]:
df.describe()

       sepal_length  sepal_width  petal_length  petal_width
count    150.000000   150.000000    150.000000   150.000000
mean       5.843333     3.057333      3.758000     1.199333
std        0.828066     0.435866      1.765298     0.762238
min        4.300000     2.000000      1.000000     0.100000
25%        5.100000     2.800000      1.600000     0.300000
50%        5.800000     3.000000      4.350000     1.300000
75%        6.400000     3.300000      5.100000     1.800000
max        7.900000     4.400000      6.900000     2.500000

In [30]:
df.columns

Index(['sepal_length', 'sepal_width', 'petal_length', 'petal_width',
       'species'],
      dtype='object')

In [31]:
df_selected = df[['sepal_length', 'sepal_width', 'species']]

In [32]:
df_selected.head()

   sepal_length  sepal_width species
0           5.1          3.5  setosa
1           4.9          3.0  setosa
2           4.7          3.2  setosa
3           4.6          3.1  setosa
4           5.0          3.6  setosa

In [33]:
# Filter by flower species
df_setosa = df[df['species'] == 'setosa']
df_setosa.head()

   sepal_length  sepal_width  petal_length  petal_width species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa

In [34]:
df['petal area'] = df['petal_length'] * df['petal_width']

In [35]:
df.head()

   sepal_length  sepal_width  petal_length  petal_width species  petal area
0           5.1          3.5           1.4          0.2  setosa        0.28
1           4.9          3.0           1.4          0.2  setosa        0.28
2           4.7          3.2           1.3          0.2  setosa        0.26
3           4.6          3.1           1.5          0.2  setosa        0.30
4           5.0          3.6           1.4          0.2  setosa        0.28

In [36]:
df['species'].nunique()

3

In [37]:
df['species'].unique()

array(['setosa', 'versicolor', 'virginica'], dtype=object)

In [38]:
df.groupby('species')['petal_length'].mean()

species
setosa        1.462
versicolor    4.260
virginica     5.552
Name: petal_length, dtype: float64